1c_um/src/ChartsOfCharacteristicTypes/ум_Константы/ум_Константы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ум_Константы</name>
  <type>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.ум_СпособыОбработкиПакетов</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>100</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИмяДляРазработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

1c_um/src/InformationRegisters/ум_ЗначенияКонстант/ум_ЗначенияКонстант.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ЗначенияКонстант</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ум_Константы</types>
    </type>
  </resources>
  <dimensions>
    <name>Константа</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ум_Константы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/ChartsOfCharacteristicTypes/ум_Константы/Forms/ФормаЭлемента/Module.bsl
// ТУДУ
// Сделать работу формы полностью. Заполнение имени разарботчика аналогично способам обработки
// При нажатии кнопки история - открывать список РС с отбором по константе с блокировкрой владельца. Пользователь может там сделать все что угодно. 
// При записи значений в истории нужно опопвещать эту форму и перечитывать актуальное значение. Если актуального значения нет - очищать поля.
// Не давать записывать константу если не заполнено актуальное значение. То значение, которое указа лпользовател нужно класть в РС без контролей.
// Нужно оповещать при записи историии и константы список констант - там перечитывать все.

#Область ОбработчикиСобытийФормы

// при открытии формы НОВОЙ нужно установить дату значения 01.01.1970.
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		// это новый объект
		ЭтоСоставнойТип = Объект.ТипЗначения.Типы().Количество() > 1;
		Элементы.ЗначениеКонстанты.ВыбиратьТип = ЭтоСоставнойТип;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаУстановкиЗначения) Тогда
		ДатаУстановкиЗначения = Дата(1970, 01, 01);
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЭтоСоставнойТип = Объект.ТипЗначения.Типы().Количество() > 1;
	Элементы.ЗначениеКонстанты.ВыбиратьТип = ЭтоСоставнойТип;
	ПрочитатьПериодИЗначениеКонстанты();
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ТекущийОбъект.ЭтоГруппа Тогда
		Если Не ЗначениеЗаполнено(ТекущийОбъект.ИмяДляРазработчика) Тогда
			ТекущийОбъект.ИмяДляРазработчика = ум_ПакетыДанныхОбщегоНазначения.УникальноеИмяДляРазработчика(ТекущийОбъект.Наименование, ТекущийОбъект.Ссылка);
		Иначе
			ум_ПакетыДанныхОбщегоНазначения.ПроверитьУникальностьИмяДляРазработчика(ТекущийОбъект.ИмяДляРазработчика, ТекущийОбъект.Ссылка, Отказ);
		КонецЕсли;
		Если ЗначениеКонстанты = Неопределено Тогда
			ТекстОшибки = "Значение константы не заполнео!";
			ум_БСП_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,"ЗначениеКонстанты", ,Отказ);
		КонецЕсли;
	КонецЕсли;
	
	// Без этих доп свойств не запишутся значения констант
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗначениеКонстанты",     ЗначениеКонстанты);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДатаУстановкиЗначения", ДатаУстановкиЗначения);
	
КонецПроцедуры // ПередЗаписьюНаСервере()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ум_ЗаписьЗначенияКонстанты" И Параметр = Объект.Ссылка Тогда
		ЗначениеКонстанты = ПолучитьЗначениеКонстанты(Объект.Ссылка, ДатаУстановкиЗначения);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	ЭтоСоставнойТип = Объект.ТипЗначения.Типы().Количество() > 1;
	Элементы.ЗначениеКонстанты.ВыбиратьТип = ЭтоСоставнойТип;
КонецПроцедуры // ТипЗначенияПриИзменении()

#КонецОбласти

#Область ОбработчикиКомандФормы

// При нажатии кнопки история - открывать список РС с отбором по константе
// с блокировкрой владельца. Пользователь может там сделать все что угодно. 
&НаКлиенте
Процедура ИсторияЗначений(Команда)
	
	ОтборНаФорме = Новый Структура("Константа", Объект.Ссылка);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ОтборНаФорме);
	ОткрытьФорму("РегистрСведений.ум_ЗначенияКонстант.ФормаСписка",
				 ПараметрыФормы,
				 ЭтаФорма,
				 УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца
	);
	
КонецПроцедуры // ИсторияЗначений()

&НаКлиенте
Процедура ЗаполнитьИмяДляРазработчика(Команда)
	ЗаполнитьИмяДляРазработчикаНаСервере();
КонецПроцедуры // ЗаполнитьИмяДляРазработчика()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьИмяДляРазработчикаНаСервере()
	Объект.ИмяДляРазработчика = ум_ПакетыДанныхОбщегоНазначения.УникальноеИмяДляРазработчика(Объект.Наименование, Объект.Ссылка);
КонецПроцедуры // ЗаполнитьИмяДляРазработчикаНаСервере()

&НаСервереБезКонтекста
Функция ПолучитьЗначениеКонстанты(Константа, ДатаУстановкиЗначения)
	Перем Результат;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Константа", Константа);
	Запрос.УстановитьПараметр("ДатаУстановкиЗначения", ДатаУстановкиЗначения);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ум_ЗначенияКонстант.Значение КАК Значение,
	|	ум_ЗначенияКонстант.Период КАК Период
	|ИЗ
	|	РегистрСведений.ум_ЗначенияКонстант КАК ум_ЗначенияКонстант
	|ГДЕ
	|	ум_ЗначенияКонстант.Константа = &Константа
	|	И ум_ЗначенияКонстант.Период <= &ДатаУстановкиЗначения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Значение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьЗначениеКонстанты()

&НаСервере
Процедура ПрочитатьПериодИЗначениеКонстанты()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Константа", Объект.Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ум_ЗначенияКонстант.Значение КАК Значение,
	|	ум_ЗначенияКонстант.Период КАК Период
	|ИЗ
	|	РегистрСведений.ум_ЗначенияКонстант КАК ум_ЗначенияКонстант
	|ГДЕ
	|	ум_ЗначенияКонстант.Константа = &Константа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаУстановкиЗначения = Выборка.Период;
		ЗначениеКонстанты     = Выборка.Значение;
	КонецЕсли;
	
КонецПроцедуры // ПрочитатьПериодИЗначениеКонстанты()

#КонецОбласти
